In [1]:
import sqlite3 as sql
import pandas as pd
import numpy as np
import vaex as vx

In [2]:
l = ['argentina','chile','china','panama','puerto_rico','norway','brazil','colombia','peru','australia','greece','UK','japan','south_africa','egypt','iceland','canada','mexico','portugal','spain','germany']
ld = {'argentina':'buenos_aires','chile':'santiago','china':'beijing','panama':'panama_city','puerto_rico':'san_juan','norway':'oslo','brazil':'brasilia','colombia':'bogota','peru':'lima','australia':'canberra','greece':'athens','UK':'london','japan':'tokyo','south_africa':'pretoria','egypt':'cairo','iceland':'reykjavik','canada':'ottawa','mexico':'mexico_city','portugal':'lisbon','spain':'madrid','germany':'berlin'}

In [3]:
df = vx.from_dict({'site_id':np.random.choice(l, size=1000), 'age':np.random.choice(range(18, 101), size=1000), 'weight':np.random.uniform(50, 95, size=1000),
                  'sex':np.random.choice(['F','M'], 1000), 'date':pd.date_range('2020-01-01', periods=1000, freq='60min')})

In [4]:
dt = vx.from_dict({'site_id':np.random.choice(l, size=1000), 'age':np.random.choice(range(18, 101), size=1000), 'weight':np.random.uniform(50, 95, size=1000),
                  'sex':np.random.choice(['F','M'], 1000), 'date':pd.date_range('2020-01-01', periods=1000, freq='60min')})

In [5]:
dc = pd.DataFrame({'site_id':l, 'city':list(ld.values())})

In [6]:
df = df.to_pandas_df()
dt = dt.to_pandas_df()

In [7]:
#criando conexão db
con = sql.connect('teste.db')

In [8]:
#introduzindo datasets ao db
df.to_sql('users', con=con)
dt.to_sql('users2', con=con)
dc.to_sql('users3', con=con)

GROUP BY and ORDER BY

In [9]:
#média de idade por país
pd.read_sql_query("SELECT site_id, avg(age) AS age_avg \
                                 FROM users \
                                 GROUP BY site_id \
                                 ORDER BY avg(age) ", con)

         site_id    age_avg
0          china  52.777778
1        iceland  54.812500
2      australia  54.982759
3         brazil  55.000000
4         mexico  55.066667
5       colombia  56.520000
6         greece  57.580000
7          japan  58.285714
8          spain  58.301887
9          egypt  58.490566
10        canada  58.519231
11         chile  59.021277
12        panama  59.880952
13          peru  59.975000
14       germany  62.428571
15     argentina  62.481481
16      portugal  63.431818
17        norway  63.826923
18  south_africa  64.204082
19   puerto_rico  66.400000
20            UK  69.555556

In [10]:
#idade mínima de cada país
pd.read_sql_query("SELECT site_id, age AS age_min\
                                 FROM users \
                                 GROUP BY site_id \
                                 ORDER BY min(age) ", con)

         site_id  age_min
0             UK       18
1      australia       18
2         canada       18
3       colombia       18
4         greece       18
5         mexico       18
6    puerto_rico       18
7          spain       18
8      argentina       19
9          egypt       19
10        panama       19
11          peru       19
12        brazil       20
13       iceland       20
14      portugal       20
15         chile       21
16         japan       21
17         china       22
18        norway       24
19  south_africa       24
20       germany       25

In [11]:
#idade máxima de cada país
pd.read_sql_query("SELECT site_id, age AS age_max \
                     FROM users \
                     GROUP BY site_id \
                     ORDER BY max(age) ", con)

         site_id  age_max
0          japan       95
1           peru       95
2          spain       95
3         greece       96
4         mexico       96
5          china       97
6      australia       98
7         brazil       98
8             UK       99
9          egypt       99
10       iceland       99
11     argentina      100
12        canada      100
13         chile      100
14      colombia      100
15       germany      100
16        norway      100
17        panama      100
18      portugal      100
19   puerto_rico      100
20  south_africa      100

In [12]:
#contagem de linhas de cada país
pd.read_sql_query("SELECT site_id, count() AS site_count  \
                     FROM users \
                     GROUP BY site_id \
                     ORDER BY count() ", con)

         site_id  site_count
0         brazil          39
1           peru          40
2        germany          42
3          japan          42
4         panama          42
5       portugal          44
6             UK          45
7          china          45
8         mexico          45
9          chile          47
10       iceland          48
11  south_africa          49
12      colombia          50
13        greece          50
14   puerto_rico          50
15        canada          52
16        norway          52
17         egypt          53
18         spain          53
19     argentina          54
20     australia          58

WHERE &nbsp;

between &nbsp;

in

In [13]:
#dados em que as idades estão entre 20 e 40 anos para o país brazil
pd.read_sql_query("SELECT site_id, age \
                     FROM users \
                     WHERE age between 20 and 40 and site_id == 'brazil' \
                     ORDER BY age ", con)

   site_id  age
0   brazil   20
1   brazil   23
2   brazil   27
3   brazil   28
4   brazil   29
5   brazil   30
6   brazil   30
7   brazil   33
8   brazil   34
9   brazil   34
10  brazil   37

In [14]:
#dados somentes dos países egypt e greece
pd.read_sql_query("SELECT site_id, age \
                     FROM users \
                     WHERE site_id in ('egypt', 'greece') \
                     ORDER BY age ", con)

    site_id  age
0    greece   18
1    greece   18
2     egypt   19
3     egypt   19
4    greece   20
..      ...  ...
98    egypt   95
99    egypt   96
100  greece   96
101   egypt   98
102   egypt   99

[103 rows x 2 columns]

DISTINCT

In [15]:
#países em valores singulares
pd.read_sql_query("SELECT DISTINCT site_id \
                   FROM users", con)

         site_id
0         norway
1       colombia
2          japan
3         panama
4        germany
5      argentina
6    puerto_rico
7         mexico
8         canada
9          china
10         chile
11         spain
12         egypt
13     australia
14       iceland
15  south_africa
16            UK
17          peru
18        brazil
19      portugal
20        greece

WHERE with date value

In [16]:
#dados onde a data é maior que 2020-02-01
pd.read_sql_query("SELECT site_id, age, date \
                     FROM users \
                     WHERE date(date) > '2020-02-01' \
                     ORDER BY date ", con)

          site_id  age                 date
0           japan   33  2020-02-02 00:00:00
1         germany   29  2020-02-02 01:00:00
2           egypt   84  2020-02-02 02:00:00
3        colombia   66  2020-02-02 03:00:00
4    south_africa   99  2020-02-02 04:00:00
..            ...  ...                  ...
227        brazil   64  2020-02-11 11:00:00
228        norway   78  2020-02-11 12:00:00
229         spain   85  2020-02-11 13:00:00
230        norway   32  2020-02-11 14:00:00
231        norway   98  2020-02-11 15:00:00

[232 rows x 3 columns]

In [17]:
#média de idade para cada data do país
pd.read_sql_query("SELECT site_id, avg(age) AS age_avg, date(date) \
                     FROM users \
                     GROUP BY site_id,date(date)", con)

    site_id  age_avg  date(date)
0        UK     45.0  2020-01-02
1        UK     74.0  2020-01-03
2        UK     51.0  2020-01-04
3        UK     50.0  2020-01-06
4        UK     80.0  2020-01-07
..      ...      ...         ...
599   spain     61.0  2020-02-07
600   spain     71.0  2020-02-08
601   spain     64.5  2020-02-09
602   spain     44.5  2020-02-10
603   spain     85.0  2020-02-11

[604 rows x 3 columns]

UPDATE and DELETE

In [18]:
#alterando valor de um dado específico
con.execute("UPDATE users SET site_id == 'united_kingdom' WHERE site_id == 'UK' ")
pd.read_sql_query("SELECT site_id, age \
                   FROM users \
                   WHERE site_id == 'united_kingdom'", con)

           site_id  age
0   united_kingdom   45
1   united_kingdom   74
2   united_kingdom   51
3   united_kingdom   50
4   united_kingdom   86
5   united_kingdom   74
6   united_kingdom   85
7   united_kingdom   69
8   united_kingdom   65
9   united_kingdom   18
10  united_kingdom   81
11  united_kingdom   88
12  united_kingdom   22
13  united_kingdom   91
14  united_kingdom   83
15  united_kingdom   93
16  united_kingdom   41
17  united_kingdom   74
18  united_kingdom   51
19  united_kingdom   93
20  united_kingdom   97
21  united_kingdom   99
22  united_kingdom   30
23  united_kingdom   33
24  united_kingdom   56
25  united_kingdom   26
26  united_kingdom   94
27  united_kingdom   27
28  united_kingdom   26
29  united_kingdom   61
30  united_kingdom   68
31  united_kingdom   92
32  united_kingdom   98
33  united_kingdom   86
34  united_kingdom   99
35  united_kingdom   89
36  united_kingdom   97
37  united_kingdom   26
38  united_kingdom   92
39  united_kingdom   53
40  united_kingdom   88
41  united_kingdom   88
42  united_kingdom   87
43  united_kingdom   93
44  united_kingdom   91

In [19]:
#deletando dados de um país
con.execute("DELETE FROM users WHERE site_id == 'norway' ")
pd.read_sql_query("SELECT site_id \
                   FROM users \
                   GROUP BY site_id", con)

           site_id
0        argentina
1        australia
2           brazil
3           canada
4            chile
5            china
6         colombia
7            egypt
8          germany
9           greece
10         iceland
11           japan
12          mexico
13          panama
14            peru
15        portugal
16     puerto_rico
17    south_africa
18           spain
19  united_kingdom

CASE WHEN ELSE

In [20]:
#nova coluna com novos valores baseados em condições de uma outra coluna
pd.read_sql_query("SELECT site_id, age, \
                   CASE WHEN site_id in ('brazil', 'peru') THEN 'X' ELSE 'S' END AS case_c \
                   FROM users ", con)

          site_id  age case_c
0        colombia   67      S
1           japan   52      S
2        colombia   30      S
3          panama   92      S
4           japan   73      S
..            ...  ...    ...
943        brazil   48      X
944       germany   99      S
945  south_africa   73      S
946        brazil   64      X
947         spain   85      S

[948 rows x 3 columns]

IFNULL and COALESCE

In [21]:
#substituindo valores null
pd.read_sql_query("SELECT site_id, age, \
                   IFNULL(CASE WHEN site_id in ('brazil', 'peru') THEN 'X' END, 'y') AS case_c \
                   FROM users ", con)

          site_id  age case_c
0        colombia   67      y
1           japan   52      y
2        colombia   30      y
3          panama   92      y
4           japan   73      y
..            ...  ...    ...
943        brazil   48      X
944       germany   99      y
945  south_africa   73      y
946        brazil   64      X
947         spain   85      y

[948 rows x 3 columns]

In [22]:
pd.read_sql_query("SELECT site_id, age, \
                   COALESCE(CASE WHEN site_id in ('brazil', 'peru') THEN 'X' END, 'y ') AS case_c \
                   FROM users ", con)

          site_id  age case_c
0        colombia   67     y
1           japan   52     y
2        colombia   30     y
3          panama   92     y
4           japan   73     y
..            ...  ...    ...
943        brazil   48      X
944       germany   99     y
945  south_africa   73     y
946        brazil   64      X
947         spain   85     y

[948 rows x 3 columns]

INNER JOIN

In [23]:
#combinando valores de outra tabela
pd.read_sql_query("SELECT users.site_id, city, age \
                       FROM users \
                       INNER JOIN users3 ON users.site_id = users3.site_id", con)

          site_id         city  age
0        colombia       bogota   67
1           japan        tokyo   52
2        colombia       bogota   30
3          panama  panama_city   92
4           japan        tokyo   73
..            ...          ...  ...
898        brazil     brasilia   48
899       germany       berlin   99
900  south_africa     pretoria   73
901        brazil     brasilia   64
902         spain       madrid   85

[903 rows x 3 columns]

In [24]:
pd.read_sql_query("SELECT users3.site_id, city, age \
                   FROM users3 \
                   INNER JOIN users ON users3.site_id = users.site_id", con)

       site_id          city  age
0    argentina  buenos_aires   19
1    argentina  buenos_aires   20
2    argentina  buenos_aires   21
3    argentina  buenos_aires   22
4    argentina  buenos_aires   23
..         ...           ...  ...
898    germany        berlin   93
899    germany        berlin   99
900    germany        berlin   99
901    germany        berlin   99
902    germany        berlin  100

[903 rows x 3 columns]

CONCATENATE

In [25]:
#concatenando valores de colunas diferentes
pd.read_sql_query("SELECT users.site_id||' <•> '||city AS country_city, age \
                   FROM users \
                   INNER JOIN users3 ON users3.site_id = users.site_id", con)

                  country_city  age
0          colombia <•> bogota   67
1              japan <•> tokyo   52
2          colombia <•> bogota   30
3       panama <•> panama_city   92
4              japan <•> tokyo   73
..                         ...  ...
898        brazil <•> brasilia   48
899         germany <•> berlin   99
900  south_africa <•> pretoria   73
901        brazil <•> brasilia   64
902           spain <•> madrid   85

[903 rows x 2 columns]